malbanGit/ESP32_P4_Vectrex/main/main.c
#define BLUETOOTH_ENABLED //must change CMakeLists.txt sdkconfig and idf_component.yml

// with bluetooth / nimble enabled, not enough DRAM for VecSim
//#define VECSIM
#define VECTREX


// karl on LCD demo 1 46 !!!!
// spike is now very VERY slow???? -> Spike IS so slow!!!
#include "defines.h"

/*
Bug:
    - Minestorm bug is still active?

     - dot protection - done

     berzerk likes t1 timer to be 2 or 5
     minestorm prefers 2
     cleanseep hates 5

    - pole position flimmert bei game over und hat emu fps von 43? Ja hat kein WR.
    - clipping
    - individial configuration ini 



    - lunar lander, red baron, Asteroids and battlezone analog sounds
    - clipping for sim emulations
    - lunar lander after first live - slow, joystick does not center
    - red baron joystick does not center
    - reboot "m" does not always work (asteroids, lunar)
    - sometimes an "old" frame seems to jump in?
    - if overlay is not found -> correct the size to NO overlay!

    - make DOTS brighter!
    - higher glows get not undrawn?


    - in readevent
      poll get9PinAnalog() only once each second?

    VECX TODO
    - Highscore saving
    - settings save to ini
    - sound volume
    - Calibration Ala Tuts
    - Spinner
    - timer and shift delays -> expl

    Framework todo
    - build a audio mixer for samples - which should be "stackable"
    - int playWAV();
    - Bluetooth

Try out ESP IDF 6 with 400 Mhz -> not working with my chip!!!

Pessimism to free DRAM
    - moved CART_ROM to PSRAM
    - moved STACK to PSRAM
    - moved all "line data" to PSRAM
-> seems not to make a great difference (perhaps 1 FPS?) - but we have some dram to spare - whenever we might need it!

NOTE:
EMU FPS
returns the Hz of display of the Vectrex.
If a game runs too slow - I mean if one round of display takes longer then 30000 cycles,
the the EMU FPS drops also. 
This is like the real vectrex - and no slowdown of emulation!

*/

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "esp_check.h"
#include "esp_clk_tree.h"
#include "esp_heap_caps.h"
#include "driver/gpio.h"
#include "driver/i2c_master.h"
#include "esp_ldo_regulator.h"
#include "esp_lcd_mipi_dsi.h"
#include "esp_lcd_panel_io.h"
#include "esp_lcd_panel_ops.h"
#include "esp_lcd_lt8912b.h"

// analog gpio
#include "soc/soc_caps.h"
#include "esp_adc/adc_oneshot.h"
#include "esp_adc/adc_cali.h"
#include "esp_adc/adc_cali_scheme.h"


#include <math.h>

#include "board.h"
#include "hdmi.h"
#include "lvds.h"
#include "lodepng.h"

#include "draw_line_yuv422.h"

char * audio_buf;
size_t audio_bufsize;

DRAM_ATTR uint32_t g_beam_r2_q16;
DRAM_ATTR int g_line_Rb = (((LINE_WIDTH >> 1) + LINE_GLOW_WIDTH) > 0) ? ((LINE_WIDTH >> 1) + LINE_GLOW_WIDTH - 1) : 0;
DRAM_ATTR int g_beam_r = LINE_WIDTH >> 1;
DRAM_ATTR uint32_t g_gs;
DRAM_ATTR int g_color_mode; // 0 = not color, 1 = color
DRAM_ATTR int g_fpsToReach=  1000000/MAX_EMU_FPS;
DRAM_ATTR volatile input_state_t g_inputState={127,127,127,127,255}; 

DRAM_ATTR int g_Orientation = ORIENTATION_90; // LCD intern default

IRAM_ATTR static inline void _changeGlobalLineValues(int w, int g)
{
    g_line_width = w;
    g_line_glow = g;

    // Precomputed bounding-box radius shared by all draw/undraw functions and ASM.
    // Must be updated if g_line_width or g_line_glow ever change at runtime.     
    g_line_Rb = (((g_line_width >> 1) + g_line_glow) > 0) ? ((g_line_width >> 1) + g_line_glow - 1) : 0;
    g_beam_r = g_line_width >> 1;
    g_beam_r2_q16  = cap_d2_q16(g_beam_r, 0);
    g_gs = gs_for_glow(g_line_glow);
}

void changeGlobalLineValues(int w, int g)
{
    g_line_width = w;
    g_line_glow = g;

    // Precomputed bounding-box radius shared by all draw/undraw functions and ASM.
    // Must be updated if g_line_width or g_line_glow ever change at runtime.     
    g_line_Rb = (((g_line_width >> 1) + g_line_glow) > 0) ? ((g_line_width >> 1) + g_line_glow - 1) : 0;
    g_beam_r = g_line_width >> 1;
    g_beam_r2_q16  = cap_d2_q16(g_beam_r, 0);
    g_gs = gs_for_glow(g_line_glow);
}


esp_lcd_dsi_bus_handle_t dsi_bus = NULL;

i2c_master_bus_handle_t i2c_bus = NULL;
i2c_master_bus_config_t i2c_bus_cfg = {
    .clk_source = I2C_CLK_SRC_DEFAULT,
    .i2c_port = BOARD_I2C_PORT,
    .sda_io_num = BOARD_I2C_SDA,
    .scl_io_num = BOARD_I2C_SCL,
    .glitch_ignore_cnt = 7,
    .flags.enable_internal_pullup = true,
};

// Shared flag — core 1 writes, core 0 reads
static volatile int s_toggle_display_mode = 0; // sentinel "no switch"
static volatile int s_toggle_overlay_mode = 0; // sentinel "no switch"
static volatile int s_toggle_orientation = 0; // sentinel "no switch"


// ----------------------------------------------------
// Global line settings
// ----------------------------------------------------
DRAM_ATTR int  g_line_width = LINE_WIDTH;      // >= 1
DRAM_ATTR int  g_line_glow  = LINE_GLOW_WIDTH;
DRAM_ATTR int  brightnessAdjust = BRIGHTNESS_ADJUST;
DRAM_ATTR int  brightnessLCD = DEFAULT_LCD_BRIGHTNESS;
DRAM_ATTR int LCD_H_RES = 1280; // overwritten when screen is initialized
DRAM_ATTR int LCD_V_RES = 720;

DRAM_ATTR uint8_t  s_overlay_alpha_val = GLOBAL_OVERLAY_ALPHA;  /* representative raw alpha */

//hdmi 1280x720
//vdsl 480x800

DRAM_ATTR int mini9PinButton; // zero active
DRAM_ATTR int miniUSBButton; // zero active
#ifdef BLUETOOTH_ENABLED
DRAM_ATTR int miniBTButton; // zero active
#endif
DRAM_ATTR int miniVideoButton; // bool
DRAM_ATTR int miniResetButton; // bool
DRAM_ATTR int miniHPD; // bool
DRAM_ATTR int miniSD;  // bool


static const char *TAG = "main";

DRAM_ATTR uint8_t *s_overlay    = NULL;    // this is a palette based overlay. 127 palette entries. if bit 7 is set, then alpha is present
DRAM_ATTR uint8_t *s_overlay_bg = NULL;   /* precomputed RGB888 overlay-over-black */


