malbanGit/ESP32_P4_Vectrex/main/main.c
void toggleVideoMode()
{
    // shut Down
    lcd_deinit();

    vTaskDelay(pdMS_TO_TICKS(20)); // I never needed this - but doc says after bus reinit - one should wait a bit?

    if (isHDMI())  mode = VIDEO_OUT_LVDS;
    else   mode = VIDEO_OUT_HDMI;

    lcd_init();

    // audio is simply a switch 
    if (isHDMI())
    {
        gpio_set_level(GPIO_OUTPUT_PA, 0);   // speaker off
        /* enable LT8912B I2S audio input — CEC bank reg 0xB2 */
        uint8_t val = 0x01;
        esp_lcd_panel_io_tx_param(lt_io.cec_dsi, 0xB2, &val, 1);
    }
    else
    {
        // switch off with
        gpio_set_level(GPIO_OUTPUT_PA, 1);   // speaker on
        uint8_t val = 0x00;
        esp_lcd_panel_io_tx_param(lt_io.cec_dsi, 0xB2, &val, 1);
    }
    loadOverlayRGB(lastOverlay);
    fireResizeEvent();
    printDisplayState();
}

// physical device reolution
int getScreenWidth()
{
    if ((g_Orientation == ORIENTATION_90) || (g_Orientation == ORIENTATION_270))
        return LCD_V_RES;
    return LCD_H_RES;
}

int getScreenHeight()
{
    if ((g_Orientation == ORIENTATION_90) || (g_Orientation == ORIENTATION_270))
        return LCD_H_RES;
    return LCD_V_RES;
}

// actual part of the screen used for display
int getDisplayWidth()
{
    if (isHDMI())
    {
        if ((g_Orientation == ORIENTATION_90) || (g_Orientation == ORIENTATION_270))
        {
            if (overlayEnabled)
                return HDMI_PORTRAIT_IN_OVERLAY_VECX_WIDTH;
            else
                return HDMI_PORTRAIT_VECX_WIDTH;
        }
        else
        {
            if (overlayEnabled)
                return HDMI_IN_OVERLAY_VECX_WIDTH;
            else
                return HDMI_VECX_WIDTH;
        }
    }
    // LCD
    if ((g_Orientation == ORIENTATION_0) || (g_Orientation == ORIENTATION_180))
    {
        if (overlayEnabled)
            return LCD_LANDSCAPE_IN_OVERLAY_VECX_WIDTH;
        return LCD_LANDSCAPE_VECX_WIDTH;
    }
    if (overlayEnabled)
        return LCD_IN_OVERLAY_VECX_WIDTH;
    return LCD_VECX_WIDTH;
}
int getDisplayHeight()
{
    if (isHDMI())
    {
        if ((g_Orientation == ORIENTATION_90) || (g_Orientation == ORIENTATION_270))
        {
            if (overlayEnabled)
                return HDMI_PORTRAIT_IN_OVERLAY_VECX_HEIGHT;
            else
                return HDMI_PORTRAIT_VECX_HEIGHT;
        }
        else
        {
            if (overlayEnabled)
                return HDMI_IN_OVERLAY_VECX_HEIGHT;
            else
                return HDMI_VECX_HEIGHT;
        }
    }
    if ((g_Orientation == ORIENTATION_0) || (g_Orientation == ORIENTATION_180))
    {
        if (overlayEnabled)
            return LCD_LANDSCAPE_IN_OVERLAY_VECX_HEIGHT;
        return LCD_LANDSCAPE_VECX_HEIGHT;
    }
    if (overlayEnabled)
        return LCD_IN_OVERLAY_VECX_HEIGHT;
    return LCD_VECX_HEIGHT;
}


// called during endframe
// input as expected by vectrex
// analog from -128 - +127
// buttons 0 active!
// one byte
// 7654 3210 (bits)
// 2222 1111 (player)
// 4321 4321 (buttons)
IRAM_ATTR void readevents()
{
    // center is default unless pressed!
	g_inputState.j0_x=0;
	g_inputState.j0_y=0;
	g_inputState.j1_x=0;
	g_inputState.j1_y=0;
    g_inputState.buttonState = 0xff;


    // if there is a joystick available - use it, not the keyboard!
    get9PinAnalog(); // ADC Joystick and volume control 
    if (is9PinJoystickAvailable())
    {
        g_inputState.buttonState = getGPIOSwitches(); // GPIO, just the four buttons
        g_inputState.j0_x = get9PinAnalogX(); // values from -128 - +127
        g_inputState.j0_y = get9PinAnalogY();
    }
    else
    {
        if (isUSBJoystickAvailable())
        {
            g_inputState.buttonState = miniUSBButton; // just the four buttons
            g_inputState.j0_x = getUSBAnalogX(); // values from -128 - +127
            g_inputState.j0_y = getUSBAnalogY();
        }
        else
        {
#ifdef BLUETOOTH_ENABLED
            // In your application loop:
            if (isBTJoystickAvailable(0)) 
            {
                readBTData(0);
                g_inputState.buttonState = (g_inputState.buttonState & (0xf0 | getBTButtons(0)));
                g_inputState.j0_x = (int8_t)getBTAnalogX(0);
                g_inputState.j0_y = (int8_t)getBTAnalogY(0);
            }
            else
#endif            
            {
                // attached keyboard (slow due to pulls!)
                // mapping as in Vide
                /* Player 1 */
                if (isKeyDown(HID_KEY_LEFT)) g_inputState.j0_x = -128;
                if (isKeyDown(HID_KEY_RIGHT)) g_inputState.j0_x = 127;
                if (isKeyDown(HID_KEY_UP)) g_inputState.j0_y = 127;
                if (isKeyDown(HID_KEY_DOWN)) g_inputState.j0_y = -128;

                /* Player 1 */
                if (isAsciiDown('a'))
                    g_inputState.buttonState &= ~1;
                else
                    g_inputState.buttonState |= 1;

                if (isAsciiDown('s'))
                    g_inputState.buttonState &= ~2;
                else
                    g_inputState.buttonState |= 2;

                if (isAsciiDown('d'))
                    g_inputState.buttonState &= ~4;
                else
                    g_inputState.buttonState |= 4;

                if (isAsciiDown('f'))
                    g_inputState.buttonState &= ~8;
                else
                    g_inputState.buttonState |= 8;
            }
        }
    }


    // player two might play via keyboard        
    /* Player 2 */
#ifdef BLUETOOTH_ENABLED
    if (isBTJoystickAvailable(1)) {
        readBTData(1);
        g_inputState.buttonState = (g_inputState.buttonState & (0x0f | getBTButtons(1)));
        g_inputState.j1_x = (int8_t)getBTAnalogX(1);
        g_inputState.j1_y = (int8_t)getBTAnalogY(1);
    }
    else
#endif    
    {
        if (isKeyDown('h')) g_inputState.j1_x = -128;
        if (isKeyDown('j')) g_inputState.j1_x = 127;
        if (isKeyDown('u')) g_inputState.j1_y = 127;
        if (isKeyDown('n')) g_inputState.j1_y = -128;

        if (isAsciiDown('q'))
            g_inputState.buttonState &= ~16;
        else
            g_inputState.buttonState |= 16;

        if (isAsciiDown('w'))
            g_inputState.buttonState &= ~32;
        else
            g_inputState.buttonState |= 32;

        if (isAsciiDown('e'))
            g_inputState.buttonState &= ~64;
        else
            g_inputState.buttonState |= 64;

        if (isAsciiDown('r'))
            g_inputState.buttonState &= ~128;
        else
            g_inputState.buttonState |= 128;
    }

