malbanGit/ESP32_P4_Vectrex/main/main.c
    ////////////////////////////////////////
    ////////////////////////////////////////
    ////////////////////////////////////////

    static volatile int modeSwitchActive=0;
    if (isAsciiDown('m'))
	{
#ifdef VECSIM
        if (modeSwitchActive==0)
		{
            audio_set_callback(NULL, NULL);

            modeSwitchActive = 3;
            vecsimGame++;
            if (vecsimGame==MAX_VECSIM_GAME) 
            {
                setAppFPS(MAX_EMU_FPS);
                vecsimGame=0;
            }
            fireKillEvent();
            clearFramebuffers();
            frames_init();
            redraw = 3;
		}
        else if (modeSwitchActive==3)
        {
            modeSwitchActive = 0;
        }
#endif 
	}

    // change hdmi / LCD
    if (isAsciiDown('y'))
	{
		if (modeSwitchActive==0)
		{
            if (isLVDS())
            {
                if (!hdmi_hpd_present(&lt_io))
                {
                    mode = VIDEO_OUT_LVDS;
                    return;
                }
            }
            modeSwitchActive = 1;
			void toggleVideoModeRequest();
			toggleVideoModeRequest();
		}
	}
	else if (modeSwitchActive==1)
	{
		modeSwitchActive = 0;
	}

    // change orientation
    if (isAsciiDown('g'))
	{
		if (modeSwitchActive==0)
		{
            modeSwitchActive = 7;
			void toggleVideoOrientationRequest();
			toggleVideoOrientationRequest();
		}
	}
	else if (modeSwitchActive==7)
	{
		modeSwitchActive = 0;
	}
    
	if (isKeyDown(HID_KEY_SPACE))
	{
		if (modeSwitchActive==0)
		{
			modeSwitchActive = 2;
			void toggleOverlayRequest();
			toggleOverlayRequest();
		}
	}
	else 
	if (modeSwitchActive==2)
	{
		modeSwitchActive = 0;
	}
#ifdef BLUETOOTH_ENABLED
   	
    if (isAsciiDown('z'))
	{
		if (modeSwitchActive==0)
        {
            bt_startPairing(30); // 30 seconds of pairing enabled
            modeSwitchActive=4;
        }
	}
	else 
	if (modeSwitchActive==4)
	{
		modeSwitchActive = 0;
	}
#endif
   	if (isAsciiDown('b'))
	{
		brightnessLCD = brightnessLCD + 1;
		if (brightnessLCD>1022) brightnessLCD=1022;
		printf("brightnessLCD: %d\n", brightnessLCD);
	    lvds_backlight(true, brightnessLCD);
	}
   	if (isAsciiDown('v'))
	{
		brightnessLCD = brightnessLCD - 1;
		if (brightnessLCD<0) brightnessLCD=0;
		printf("toggleOverlay: %d\n", brightnessLCD);
	    lvds_backlight(true, brightnessLCD);
	}
	if (isKeyDown(HID_KEY_F11))
	{
		brightnessAdjust = brightnessAdjust - 1;
        redraw=3;
		printf("brightnessAdjust: %d\n", brightnessAdjust);
	}
	if (isKeyDown(HID_KEY_F12))
	{
		brightnessAdjust = brightnessAdjust + 1;
        redraw=3;
		printf("brightnessAdjust: %d\n", brightnessAdjust);
	}

	if (isKeyDown(HID_KEY_F1))
	{
		g_line_width = g_line_width - 1;
        redraw=3;
		if (g_line_width<0) g_line_width = 0;
		printf("g_line_width: %d\n", g_line_width);
		changeGlobalLineValues(g_line_width, g_line_glow);
	}
	if (isKeyDown(HID_KEY_F2))
	{
		g_line_width = g_line_width + 1;
        redraw=3;
		printf("g_line_width: %d\n", g_line_width);
		changeGlobalLineValues(g_line_width, g_line_glow);
	}
	if (isKeyDown(HID_KEY_F3))
	{
		g_line_glow = g_line_glow - 1;
        redraw=3;
		if (g_line_glow<0) g_line_glow = 0;
		printf("g_line_glow: %d\n", g_line_glow);
		changeGlobalLineValues(g_line_width, g_line_glow);
	}
	if (isKeyDown(HID_KEY_F4))
	{
		g_line_glow = g_line_glow + 1;
        redraw=3;
		printf("g_line_glow: %d\n", g_line_glow);
		changeGlobalLineValues(g_line_width, g_line_glow);
	}
}
